app/views/politician_requests/_form.html.erb

SELECT `users`.* FROM `users`
---
  <div class="field">
    <%= collection_select( :users, :user_ids, User.all, :id, :name, options = {:multiple => true})%>