app/views/politician_requests/_form.html.erb

      <%# = collection_select( :users, :id, User.all, :id, :name, {}, {:multiple => true})%>
      <%= select_tag 'user', options_from_collection_for_select(User.where(:is_politician => true), :id, :name), multiple: false, size: '10%' %>
---
SELECT `users`.* FROM `users` WHERE `users`.`is_politician` = 1