app/views/home/index.html.erb

SELECT `politician_requests`.* FROM `politician_requests` WHERE `politician_requests`.`user_id` = 2
---

					<% PoliticianRequest.where(:user_id => current_user.id).each do |politician_request| %>

SELECT `text_messages`.* FROM `text_messages` WHERE `text_messages`.`receiver` = '6302207435'
---

					<% TextMessage.where(:receiver => current_user.phone_number).each do |message| %>