app/views/text_messages/_form.html.erb

SELECT `users`.* FROM `users`
---
  <%# = collection_select( :users, :id, User.all, :id, :name, {}, {:multiple => true})%>
  <%= select_tag 'receiver', options_from_collection_for_select(User.all, :phone_number, :name), multiple: true, size: '10%' %>