app/controllers/politician_requests_controller.rb

  def index
    @politician_requests = PoliticianRequest.all
---
SELECT `politician_requests`.* FROM `politician_requests`

  def show
    @politician_request = PoliticianRequest.find(params[:id])
---
SELECT `politician_requests`.* FROM `politician_requests` WHERE `politician_requests`.`id` = 1 LIMIT 1

  def create
    @politician_request = PoliticianRequest.new(params[:politician_request])

    respond_to do |format|
      if @politician_request.save
---
INSERT INTO `politician_requests` (`created_at`, `email`, `politician`, `request`, `updated_at`, `user_id`) VALUES ('2013-06-22 19:38:47', 'rboling91@gmail.com', NULL, 'here', '2013-06-22 19:38:47', NULL)