app/controllers/text_messages_controller.rb

  def index
    @text_messages = TextMessage.all
---
SELECT `text_messages`.* FROM `text_messages`

  def show
    @text_message = TextMessage.find(params[:id])
---
SELECT "text_messages".* FROM "text_messages" WHERE "text_messages"."id" = ? LIMIT 1  [["id", "2"]]

  def create
    @text_message = TextMessage.new(params[:text_message])

    respond_to do |format|
      if @text_message.save
---
INSERT INTO "text_messages" ("content", "created_at", "receiver", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hey guy "], ["created_at", Sat, 22 Jun 2013 18:57:08 UTC +00:00], ["receiver", "315 382 8176"], ["updated_at", Sat, 22 Jun 2013 18:57:08 UTC +00:00]]